TITLE ЛР_1 
;------------------------------------------------------------------------------
;ЛР  №1
;------------------------------------------------------------------------------
; Архітектура комп'ютера
; Завдання:              Вивести на екран склад команди
; ВУЗ:                  КНУУ "КПІ"
; Факультет:    ФІОТ
; Курс:                1
; Група:       ІТ-01
;------------------------------------------------------------------------------
; Автор:        Дмитрієва Ірина
; Дата:         10.02.2021
;---------------------------------
				;I.ЗАГОЛОВОК ПРОГРАМИ
IDEAL			; Директива - тип Асемблера tasm 
MODEL small		; Директива - тип моделі пам’яті 
STACK 256		; Директива - розмір стеку 
				;II.МАКРОСИ
				;III.ПОЧАТОК СЕГМЕНТУ ДАНИХ
DATASEG
exCode db 0
message db "Team members: ",10,13,"Dmytriieva Iryna",10,13, '$';Рядок символів для виводу на екран
messagePressAnyKey db "---- Press any key to continue... ----",10,13, '$';Рядок символів для виводу на екран підказки
				;VI. ПОЧАТОК СЕГМЕНТУ КОДУ
CODESEG
Start:
;--------------------------------- 1. Ініціалізація DS и ES---------------------------------------
	mov ax,@data	; @data ідентифікатор, що створюються директивою model
	mov ds, ax	; Завантаження початку сегменту даних в регістр ds
	mov es, ax	; Завантаження початку сегменту даних в регістр es
;----------------------------------2. Операція виводу на консоль---------------------------------			
	mov dx, offset message	; Пересилання адреси рядка символів message в регістр dx		
	mov ah,09h ; Завантаження числа 09h до регістру ah (команда виводу рядка на консоль)
	int 21h	; Виклик функції DOS (9h відповідно до змісту регістру АН)	
	mov dx, offset messagePressAnyKey ; Пересилання адреси рядка з підказкою в регістр dx			
	mov ah,09h ; Завантаження до регістру ah коду функції DOS виводу рядка
	int 21h		; Виклик функції DOS (9h)
;----------------------------------3. Операція зупинки програми, очікування натискання клавіш-----
	mov ah,01h ; Завантаження числа 01h до регістру ah			
			; (Функція DOS 01h - команда введення з клавіатури - буде очікувати натискання клавіші...)
	int 21h	; Виклик функції DOS 01h
;---------------------------------4. Завершення програми---------------------------------------------
	mov ah,4ch ; Завантаження числа 4ch до регістру ah (Функція DOS 4ch - завершення програми)
	mov al,[exCode]	; отримання коду виходу 
	int 21h		; виклик функції DOS 4ch
	end Start
